# Строки

x = 1234554321
x = str(x)
print("Конфиртация в строку", x)
print("Повторение строки", x * 2)
print("Сровнение строк", "abc" > "x")
print("Сровнение строк", "a" > "B")
print("Код символа", ord("Z"))
print("Поиск позиции смвола в строке", x.find("4"))
print("Точный поиск позиции смвола в строке", x.index("4"))
print("Поиск c конца", x.rfind("4"))
print("Поиск позиции символа в диопозоне", x.find("4", 4, 7))
print("")

print("Замена символа", x.replace("4", "g"))
print("Замена символа", x.replace("5", ""))
print("Замена символов столько сколько надо", x.replace("3", "zzz", 2))
print("")

x = "FFF PPP mmm zzz"
print("В заглавные", x.upper())
print("В пропесные", x.lower())
print("Cюольшёл буквы", x.title())
print("Первое слово с большёл буквы", x.capitalize())
print("")

x = "123454321"
print("Подчёт совпадений", x.count("4"))
print("Подчёт совпадений в диопозоне", x.count("4", 1, 5))
print("Проверка строки на число", x.isdigit())
print("Проверка строки на буквы", x.isalpha())
x = "1 21 321 4321 54321 654321 7654321 87654321 987654321"
print("Конвертация строки в список", x.split())
x = ["a", "b", "c"]
x = "-".join(x)
print("Конвертация список в строки", x.)

input()